src/DataProcessors/ОбменКотировками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>ОбменКотировками</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КурсыТоварныхРынков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>КурсыТоварныхРынков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ОбменКотировками/Ext/ManagerModule.bsl
Процедура СформироватьФайлВыгрузки(Параметры, АдресХранилища) Экспорт
	
	ЗаписьJson = Новый ЗаписьJSON;
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ЗаписьJson.ОткрытьФайл(ИмяФайла);
	ТаблицыДанных = ПрочитатьДанныеДляВыгрузки();
	ЗаписатьJSON(ЗаписьJson, ТаблицыДанных);
	ЗаписьJson.Закрыть();
	
	Результат = Новый Структура;
	Результат.Вставить("Команда", "Выгрузка");
	Результат.Вставить("Файл", Новый ДвоичныеДанные(ИмяФайла));
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

Функция ПрочитатьДанныеДляВыгрузки()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалют.Валюта КАК Валюта,
	|	КурсыВалют.Курс КАК Курс,
	|	КурсыВалют.Кратность КАК Кратность,
	|	КурсыВалют.Период КАК Период
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыТоварныхРынков.Период,
	|	КурсыТоварныхРынков.Номенклатура,
	|	КурсыТоварныхРынков.Валюта,
	|	КурсыТоварныхРынков.Курс
	|ИЗ
	|	РегистрСведений.КурсыТоварныхРынков КАК КурсыТоварныхРынков";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ДанныеДляВыгрузки = Новый Структура();
	ДанныеДляВыгрузки.Вставить("КурсыВалют", ПакетЗапросов[0].Выгрузить());
	ДанныеДляВыгрузки.Вставить("КурсыТоваров", ПакетЗапросов[1].Выгрузить());

	Возврат ДанныеДляВыгрузки; 
	
КонецФункции

Процедура ЗагрузитьКотировки(Параметры, АдресХранилища) Экспорт
	
	
	ЧтениеJson = Новый ЧтениеXML;
	ЧтениеJson.ОткрытьФайл(Параметры);
	СериализаторXDTO.ПрочитатьJSON(ЧтениеJson);
	
	
	
КонецПроцедуры
